data class Likes (
    //object	Информация о лайках к записи, объект с полями:
    val count: Int = 0,
    //(integer) — число пользователей, которым понравилась запись;
    val userLikes: Boolean = false,
    // (integer, [0,1]) — наличие отметки «Мне нравится» от текущего пользователя (1 — есть, 0 — нет);
    val canLike: Boolean = true,
    // (integer, [0,1]) — информация о том, может ли текущий пользователь поставить отметку «Мне нравится» (1 — может, 0 — не может);
    val canPublish:Boolean = true,
    // (integer, [0,1]) — информация о том, может ли текущий пользователь сделать репост записи (1 — может, 0 — не может).
)